<details ><summary>plan for 01-terraform-infra_envs_dev_data 2026-02-27 18:47:25 (UTC)</summary>
          <details ><summary>Additional output for <b>k-napiontek/test#01-terraform-infra_envs_dev_data</b></summary>

```terraform
Project: main

 Name                                                        Monthly Qty  Unit            Monthly Cost   
                                                                                                         
 module.db.module.db_instance.aws_db_instance.this[0]                                                    
 ├─ Database instance (on-demand, Single-AZ, db.t3.micro)            730  hours                 $15.33   
 ├─ Storage (general purpose SSD, gp2)                                 5  GB                     $0.69   
 └─ Additional backup storage                              Monthly cost depends on usage: $0.10 per GB   
                                                                                                         
 OVERALL TOTAL                                                                                 $16.02 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
4 cloud resources were detected:
∙ 1 was estimated
∙ 3 were free

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                            ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ main                                               ┃           $16 ┃           - ┃        $16 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛

```
</details>

<details open="true"><summary>Plan output</summary>

```terraform
OpenTofu will perform the following actions:

  # aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS myapp"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "dev-myapp-rds-"
      + owner_id               = (known after apply)
      + region                 = "eu-central-1"
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Environment" = "dev"
          + "Project"     = "myapp"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-021744c76a22f8bdc"
    }

  # module.db_subnet_group.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "dev-myapp subnet group"
      + id                      = (known after apply)
      + name                    = (known after apply)
      + name_prefix             = "dev-myapp-"
      + region                  = "eu-central-1"
      + subnet_ids              = [
          + "subnet-0064320542a476f70",
          + "subnet-05c79cb66256c5a08",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "dev-myapp"
        }
      + tags_all                = {
          + "Environment" = "dev"
          + "Name"        = "dev-myapp"
          + "Project"     = "myapp"
          + "Terraform"   = "true"
        }
      + vpc_id                  = (known after apply)
    }

  # module.db.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 5
      + allow_major_version_upgrade           = false
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 1
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-06:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = true
      + database_insights_mode                = (known after apply)
      + db_name                               = "myapp"
      + db_subnet_group_name                  = (known after apply)
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "16"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = true
      + id                                    = (known after apply)
      + identifier                            = "dev-myapp"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:00:00-mon:03:00"
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + region                                = "eu-central-1"
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "Environment" = "dev"
          + "Project"     = "myapp"
          + "Terraform"   = "true"
        }
      + timezone                              = (known after apply)
      + upgrade_rollout_order                 = (known after apply)
      + username                              = "dbadmin"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.db.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn          = (known after apply)
      + description  = "dev-myapp parameter group"
      + family       = "postgres16"
      + id           = (known after apply)
      + name         = (known after apply)
      + name_prefix  = "dev-myapp-"
      + region       = "eu-central-1"
      + skip_destroy = false
      + tags         = {
          + "Name" = "dev-myapp"
        }
      + tags_all     = {
          + "Environment" = "dev"
          + "Name"        = "dev-myapp"
          + "Project"     = "myapp"
          + "Terraform"   = "true"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + db_instance_address                = (known after apply)
  + db_instance_endpoint               = (known after apply)
  + db_instance_master_user_secret_arn = (known after apply)
  + db_instance_name                   = "myapp"
  + db_instance_port                   = 5432
  + db_instance_username               = (sensitive value)
  + db_security_group_id               = (known after apply)

```
</details>


<details ><summary>Terraform plan validation check (01-terraform-infra_envs_dev_data)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |                               RESOURCE                               |
|--------|----------------------------------------------------------------------|
| add    | `aws_security_group.rds`                                             |
|        | `module.db.module.db_instance.aws_db_instance.this[0]`               |
|        | `module.db.module.db_parameter_group.aws_db_parameter_group.this[0]` |
|        | `module.db_subnet_group.aws_db_subnet_group.this[0]`                 |

| CHANGE |                OUTPUT                |
|--------|--------------------------------------|
| add    | `db_instance_address`                |
|        | `db_instance_endpoint`               |
|        | `db_instance_master_user_secret_arn` |
|        | `db_instance_name`                   |
|        | `db_instance_port`                   |
|        | `db_instance_username`               |
|        | `db_security_group_id`               |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p 01-terraform-infra_envs_dev_data
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>